zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/pio/sam4ls4c.h
#define PIN_PA21C_EIC_EXTINT6          _L(21) /**< \brief EIC signal: EXTINT6 on PA21 mux C */
#define MUX_PA21C_EIC_EXTINT6           _L(2)
#define PINMUX_PA21C_EIC_EXTINT6   ((PIN_PA21C_EIC_EXTINT6 << 16) | MUX_PA21C_EIC_EXTINT6)
#define GPIO_PA21C_EIC_EXTINT6   _UL(1 << 21)
#define PIN_PA21C_EIC_EXTINT_NUM        _L(6) /**< \brief EIC signal: PIN_PA21 External Interrupt Line */
#define PIN_PC04B_EIC_EXTINT6          _L(68) /**< \brief EIC signal: EXTINT6 on PC04 mux B */
#define MUX_PC04B_EIC_EXTINT6           _L(1)
#define PINMUX_PC04B_EIC_EXTINT6   ((PIN_PC04B_EIC_EXTINT6 << 16) | MUX_PC04B_EIC_EXTINT6)
#define GPIO_PC04B_EIC_EXTINT6   _UL(1 <<  4)
#define PIN_PC04B_EIC_EXTINT_NUM        _L(6) /**< \brief EIC signal: PIN_PC04 External Interrupt Line */
#define PIN_PA22C_EIC_EXTINT7          _L(22) /**< \brief EIC signal: EXTINT7 on PA22 mux C */
#define MUX_PA22C_EIC_EXTINT7           _L(2)
#define PINMUX_PA22C_EIC_EXTINT7   ((PIN_PA22C_EIC_EXTINT7 << 16) | MUX_PA22C_EIC_EXTINT7)
#define GPIO_PA22C_EIC_EXTINT7   _UL(1 << 22)
#define PIN_PA22C_EIC_EXTINT_NUM        _L(7) /**< \brief EIC signal: PIN_PA22 External Interrupt Line */
#define PIN_PC05B_EIC_EXTINT7          _L(69) /**< \brief EIC signal: EXTINT7 on PC05 mux B */
#define MUX_PC05B_EIC_EXTINT7           _L(1)
#define PINMUX_PC05B_EIC_EXTINT7   ((PIN_PC05B_EIC_EXTINT7 << 16) | MUX_PC05B_EIC_EXTINT7)
#define GPIO_PC05B_EIC_EXTINT7   _UL(1 <<  5)
#define PIN_PC05B_EIC_EXTINT_NUM        _L(7) /**< \brief EIC signal: PIN_PC05 External Interrupt Line */
#define PIN_PA23C_EIC_EXTINT8          _L(23) /**< \brief EIC signal: EXTINT8 on PA23 mux C */
#define MUX_PA23C_EIC_EXTINT8           _L(2)
#define PINMUX_PA23C_EIC_EXTINT8   ((PIN_PA23C_EIC_EXTINT8 << 16) | MUX_PA23C_EIC_EXTINT8)
#define GPIO_PA23C_EIC_EXTINT8   _UL(1 << 23)
#define PIN_PA23C_EIC_EXTINT_NUM        _L(8) /**< \brief EIC signal: PIN_PA23 External Interrupt Line */
#define PIN_PC06B_EIC_EXTINT8          _L(70) /**< \brief EIC signal: EXTINT8 on PC06 mux B */
#define MUX_PC06B_EIC_EXTINT8           _L(1)
#define PINMUX_PC06B_EIC_EXTINT8   ((PIN_PC06B_EIC_EXTINT8 << 16) | MUX_PC06B_EIC_EXTINT8)
#define GPIO_PC06B_EIC_EXTINT8   _UL(1 <<  6)
#define PIN_PC06B_EIC_EXTINT_NUM        _L(8) /**< \brief EIC signal: PIN_PC06 External Interrupt Line */

#endif /* _SAM4LS4C_PIO_ */
